package T_601_700;

public class T667 {

	
//	给定两个整数 n 和 k，你需要实现一个数组，这个数组包含从 1 到 n 的 n 个不同整数，同时满足以下条件：
//	① 如果这个数组是 [a1, a2, a3, ... , an] ，那么数组 [|a1 - a2|, |a2 - a3|, |a3 - a4|, ... , |an-1 - an|] 中应该有且仅有 k 个不同整数；.
//	② 如果存在多种答案，你只需实现并返回其中任意一种.

	
//	没有思路。。。
//	妈耶是找规律题,通过下边这个例子就很容易看出来
//	当n = 30， k = 20时：[1,21,2,20,3,19,4,18,5,17,6,16,7,15,8,14,9,13,10,12,11,22,23,24,25,26,27,28,29,30]
    
//	击败79%
	public int[] constructArray(int n, int k) {
        int[] ans = new int[n];
        ans[0] = 1;
        
        int num =k;
        int sign = 1;//控制加减
        for(int i=1;i<n;i++){
        	if(i<=k){
            	ans[i]=ans[i-1]+sign*num;//加减交替
            	sign*=-1;
            	num--;
        	}else{
        		ans[i] = i+1; 
        	}
        }
        return ans;
    }
    
}
